---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassSurfaceData.IsSlab
source: html/68e047a8-1349-2e7d-2029-e5afa9b14eeb.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceData.IsSlab Property

Indicates if a floor is a slab.

## Syntax (C#)
```csharp
public bool IsSlab { get; }
```